{
  "publications": [
    {
      "title": "Using MongoDB Sync to Replace Kinesis for Real-Time Fuel Data Update",
      "description": "Explores MongoDB Sync as a low-latency alternative to AWS Kinesis for fuel data synchronization.",
      "link": "https://doi.org/10.5281/zenodo.14883171"
    },
    {
      "title": "Software-Driven Automated Leak Detection in Fuel Storage Tanks",
      "description": "Presents a software solution using Redis and AWS Lambda for real-time fuel tank leak detection.",
      "link": "https://doi.org/10.5281/zenodo.14905636"
    },
    {
      "title": "Reducing Latency in Cloud-Based Fuel Monitoring Systems",
      "description": "Introduces an integrated approach to reduce latency in cloud-based fuel monitoring using edge processing.",
      "link": "https://doi.org/10.5281/zenodo.14905652"
    },
    {
      "title": "Designing Software for Real-Time Pump Dispenser Data Streaming Using AWS Kinesis",
      "description": "Describes the design of software for streaming real-time pump dispenser data using AWS Kinesis.",
      "link": "https://doi.org/10.54660/.ijmrge.2020.1.1.103-105"
    },
    {
      "title": "Scalable Cloud Solutions for Multi-Station Fuel Data Aggregation",
      "description": "Explores scalable cloud-based architectures using ECS and load balancers for fuel station data management.",
      "link": "https://doi.org/10.5281/zenodo.14880890"
    },
    {
      "title": "Developing a Microservices Architecture for Fuel Station Monitoring Systems Using AWS Lambda",
      "description": "Presents a microservices architecture using AWS Lambda for fuel station monitoring.",
      "link": "https://doi.org/10.5281/zenodo.14880923"
    },
    {
      "title": "Creating Software for Real-Time Visualization of ATG Data",
      "description": "Develops software for real-time ATG data visualization, improving monitoring and decision-making.",
      "link": "https://doi.org/10.5281/zenodo.14880968"
    },
    {
      "title": "SOFTWARE FOR REAL-TIME RECONCILIATION BETWEEN ATG AND PUMP DATA",
      "description": "Introduces software for real-time reconciliation of ATG and pump data to enhance operational accuracy.",
      "link": "https://doi.org/10.5281/zenodo.14942136"
    },
    {
      "title": "Proactive Maintenance Alerts for ATG and Dispensers Based on Usage Patterns",
      "description": "Leverages AWS IoT and SNS to use anomaly detection and slow fuel dispensing to trigger maintenance alerts.",
      "link": "https://doi.org/10.55041/isjem02261"
    },
    {
      "title": "Designing an Archival System for Long-Term Fuel System Data Analysis",
      "description": "Explores archiving strategies for fuel transactions to enable long-term analysis and compliance reporting.",
      "link": "https://doi.org/10.55041/isjem02155"
    },
    {
      "title": "Customizable Notification Systems for Critical Fuel System Events",
      "description": "Introduces a software-driven approach to alerting for fuel station anomalies, leaks, and operational issues.",
      "link": "https://doi.org/10.51219/jaimld/rohith-varma-vegesna/505"
    },
    {
      "title": "Leveraging MongoDB Multi-Sharding to Decrease Latency to Store and Retrieve Fuel Transaction",
      "description": "Explores MongoDB sharding strategies to optimize query performance and data storage efficiency in fuel systems.",
      "link": "https://doi.org/10.51219/jaimld/rohith-varma-vegesna/503"
    },
    {
      "title": "Standardizing Data Formats for Fuel Dispenser and ATG Integration",
      "description": "Discusses the importance of standard data formats for seamless integration of fuel dispensers and ATGs.",
      "link": "https://doi.org/10.51219/jaimld/rohith-varma-vegesna/512"
    },
    {
      "title": "Enhancing Fuel Station Cybersecurity: Securing IoT Devices and Cloud Data",
      "description": "Examines cybersecurity measures for fuel station IoT devices and cloud infrastructure.",
      "link": "https://doi.org/10.51219/jaimld/rohith-varma-vegesna/504"
    },
    {
      "title": "Developing Encrypted Communication Protocols for Fuel Controllers",
      "description": "Focuses on encryption techniques for securing fuel controller communications and data transmission.",
      "link": "https://doi.org/10.55041/isjem00100"
    }
  ],
  "pressReleases": [
    {
      "title": "The Future of Fueling Systems",
      "date": "Feb 24, 2025",
      "description": "Free Press Journal highlights my role in advancing fuel system automation with cloud and IoT, enhancing security and efficiency.",
      "link": "https://www.freepressjournal.in/latest-news/the-future-of-fueling-systems-automating-operations-with-cloud-and-iot"
    }
  ]
}
